<a href="https://colab.research.google.com/github/TasneemAhmed/food-orders-analysis/blob/main/GAD_Orders.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

In [3]:
df = pd.read_csv('/food_orders.csv')
df.head()

   order_id  customer_id item_name  item_price        date
0         1            1   falafel           5  11/11/2011
1         2            1     kofta           8  12/12/2012
2         3            1   chicken          44  10/10/2011
3         4            1   falafel           5    9/9/2009
4         5            1   falafel           5    9/9/2009

In [5]:
excel = pd.read_excel('/food_orders.xlsx', engine='openpyxl')
excel.head()

   order_id  customer_id item_name  item_price       date
0         1            1   falafel           5 2011-11-11
1         2            1     kofta           8 2012-12-12
2         3            1   chicken          44 2011-10-10
3         4            1   falafel           5 2009-09-09
4         5            1   falafel           5 2009-09-09

In [12]:
file_name = '/food_orders.xlsx'

In [15]:
def read_any_excel(file_name):
  file_exstension = file_name.split('.')[-1]
  if(file_exstension == 'xlsx'):
    read_engine = 'openpyxl'
  elif(file_exstension == 'xls'):
    read_engine = 'xlrd'
  
  final_output = pd.read_excel(file_name, engine= read_engine)
  return final_output

In [17]:
df_excel = read_any_excel(file_name)
df_excel.head()

   order_id  customer_id item_name  item_price       date
0         1            1   falafel           5 2011-11-11
1         2            1     kofta           8 2012-12-12
2         3            1   chicken          44 2011-10-10
3         4            1   falafel           5 2009-09-09
4         5            1   falafel           5 2009-09-09

In [22]:
df_excel.to_gbq(destination_table = 'Gad_food_resturant.food_orders_df', project_id = 'dataanalysis-1stmeeting')

Please visit this URL to authorize this application: https://accounts.google.com/o/oauth2/auth?response_type=code&client_id=725825577420-unm2gnkiprugilg743tkbig250f4sfsj.apps.googleusercontent.com&redirect_uri=urn%3Aietf%3Awg%3Aoauth%3A2.0%3Aoob&scope=https%3A%2F%2Fwww.googleapis.com%2Fauth%2Fbigquery&state=uKjx5geN0SIjspveJkVS8F4MljAx2Q&prompt=consent&access_type=offline
Enter the authorization code: 4/1AX4XfWjNHfREDgVigyG9VZb4t4labx46KC6uyhfp8L8_Xxmx0FEUHRpo0MQ

1it [00:05,  5.67s/it]

In [29]:
df_excel_transform = df_excel.drop(['customer_id'], axis=1)
df_excel_transform

    order_id item_name  item_price       date
0          1   falafel           5 2011-11-11
1          2     kofta           8 2012-12-12
2          3   chicken          44 2011-10-10
3          4   falafel           5 2009-09-09
4          5   falafel           5 2009-09-09
5          6     kofta           8 2009-12-09
6          7  Hawawshy          22 2009-09-14
7          8  Hawawshy          22 2009-09-17
8          9   chicken          44 2011-11-11
9         10     kofta           8 2011-11-11
10        11   falafel           5 2011-10-10
11        12   chicken          44 2009-09-09
12        13     kofta           8 2012-12-12
13        14     kofta           8 2011-11-14
14        15     kofta           8 2009-11-28
15        16  shawerma          15 2012-11-14
16        17  shawerma          15 2009-09-09
17        18     kofta           8 2009-09-09
18        19   falafel           5 2009-09-09
19        20  Hawawshy          22 2009-09-17
20        21   chicken          44 2012-09-14
21        21     kofta           8 2011-11-11
22        22   chicken          44 2011-10-10
23        23   falafel           5 2009-09-17
24        24  shawerma          15 2009-09-14
25        25   chicken          44 2011-10-10

In [30]:
df_excel_transform.to_gbq(destination_table= 'Gad_food_resturant.food_orders_df_transform', project_id = 'dataanalysis-1stmeeting')

1it [00:03,  3.51s/it]